# Создание словаря
person = {'имя': 'Алиса', 'возраст': 30, 'город': 'Нью-Йорк'}




# # Доступ к элементам
# name = person['имя']
#
# # Добавление и изменение элементов
# person['занятие'] = 'инженер'
# person['возраст'] = 31
#
# # Удаление элементов
# del person['город']
#
# # Проверка наличия ключа
# if 'возраст' in person:
#     print('Ключ "возраст" существует в словаре.')
#
# # Получение списка ключей и значений
# keys = person.keys()
# values = person.values()
# items = person.items()
#
# # Итерация по словарю
# for key in person:
#     print(key, person[key])
#
# # Длина словаря
# num_elements = len(person)
#



